In [33]:
# Importing dependencies

import pandas as pd
from sqlalchemy import create_engine
from config import db_username, db_password

# Path to postgres education_database
database_path = 'postgresql://{db_username}:{db_password}@localhost:5432/education_db'

In [41]:
# Create an engine that can talk to the database
engine = create_engine(database_path)
conn = engine.connect()

In [42]:
conn.execute('SELECT * FROM education_data')

In [43]:
engine

Engine(postgresql://postgres:***@localhost:5432/education_db)

In [44]:
education_df = pd.read_sql('SELECT * FROM education_data', conn)
education_df.head()

,fips_code,below_hs_diploma_2000,hs_diploma_2000,college_or_associate_2000,bachelors_or_higher_2000,percent_below_hs_diploma_2000,percent_hs_diploma_2000,percent_college_or_associate_2000,percent_bachelors_or_higher_2000,below_hs_diploma_2019,hs_diploma_2019,college_or_associate_2019,bachelors_or_higher_2019,percent_below_hs_diploma_2019,percent_hs_diploma_2019,percent_college_or_associate_2019,percent_bachelors_or_higher_2019
0,1001,5872,9332,7413,4972,21.3,33.8,26.9,18.0,4291,12551,10596,9929,11.5,33.6,28.4,26.6
1,1003,17258,28428,28178,22146,18.0,29.6,29.3,23.1,13893,41797,47274,48148,9.2,27.7,31.3,31.9
2,1005,6679,6124,4025,2068,35.3,32.4,21.3,10.9,4812,6396,4676,2080,26.8,35.6,26.0,11.6
3,1007,4984,4838,2756,962,36.8,35.7,20.4,7.1,3386,7256,3848,1678,20.9,44.9,23.8,10.4
4,1009,9960,12136,8371,3235,29.6,36.0,24.8,9.6,7763,13299,13519,5210,19.5,33.4,34.0,13.1

In [45]:
census_df = pd.read_sql('SELECT * FROM census_data', conn)
census_df.head()

,fips_code,population,median_age,household_income,per_capita_income,poverty_count,poverty_rate,unemployment_rate
0,1001,55380.0,38.2,58731.0,29819.0,8340.0,15.059588,1.690141
1,1003,212830.0,43.0,58320.0,32626.0,21704.0,10.197810,1.985622
2,1005,25361.0,40.4,32525.0,18473.0,6875.0,27.108553,3.347660
3,1007,22493.0,40.9,47542.0,20778.0,3740.0,16.627395,2.929800
4,1009,57681.0,40.7,49358.0,24747.0,7739.0,13.416896,1.322793

In [46]:
fips_df = pd.read_sql('SELECT * FROM fips_code_data', conn)
fips_df.head()

   fips_code    county state_abbr    state
0       1001  Autauga          AL  Alabama
1       1003  Baldwin          AL  Alabama
2       1005  Barbour          AL  Alabama
3       1007     Bibb          AL  Alabama
4       1009   Blount          AL  Alabama

In [48]:
view_df =  pd.read_sql('SELECT * from census_education', conn)
view_df.head()

,fips_code,population,median_age,household_income,per_capita_income,poverty_count,poverty_rate,unemployment_rate,bachelors_or_higher_2000,bachelors_or_higher_2019
0,1001,55380.0,38.2,58731.0,29819.0,8340.0,15.059588,1.690141,4972,9929
1,1003,212830.0,43.0,58320.0,32626.0,21704.0,10.197810,1.985622,22146,48148
2,1005,25361.0,40.4,32525.0,18473.0,6875.0,27.108553,3.347660,2068,2080
3,1007,22493.0,40.9,47542.0,20778.0,3740.0,16.627395,2.929800,962,1678
4,1009,57681.0,40.7,49358.0,24747.0,7739.0,13.416896,1.322793,3235,5210

In [56]:
# query from view 'county_state' and fips_code_data to analyze unemployment_rate verses education on state and county level

df1 = pd.read_sql("""SELECT f.state, f.county, ROUND(AVG(v.per_capita_income),4) AS avg_per_capita_income, ROUND(AVG(v.median_age),4) AS avg_median_age, ROUND(AVG(v.population),4) AS avg_population, ROUND(AVG(v.poverty_count),4) AS avg_poverty_count, ROUND(AVG(v.unemployment_rate),4) AS avg_unemployment_rate, ROUND(AVG(v.bachelors_or_higher_2000),2) AS avg_bachelors_or_higher_2000
FROM fips_code_data AS f
JOIN census_education AS v
ON (f.fips_code = v.fips_code)
GROUP BY f.state, f.county;""",conn)

df1.head()

,state,county,avg_per_capita_income,avg_median_age,avg_population,avg_poverty_count,avg_unemployment_rate,avg_bachelors_or_higher_2000
0,California,Mendocino,29035.0,43.1,87224.0,15251.0,4.0941,11505.0
1,Oregon,Malheur,18974.0,36.1,30412.0,5808.0,2.5352,2171.0
2,Alabama,Cullman,23468.0,40.8,82853.0,12133.0,2.2148,6162.0
3,South Dakota,Dewey,17504.0,26.9,5833.0,1809.0,9.4634,378.0
4,Oregon,Josephine,25167.0,47.7,86251.0,15384.0,3.4979,7528.0

In [54]:
# query from view 'county_state' and fips_code_data to analyze unemployment on state level by state for bubble chart

df2 = pd.read_sql("""SELECT f.state, f.county, ROUND(AVG(v.unemployment_rate),4) AS avg_unemployment_rate, ROUND(AVG(v.bachelors_or_higher_2000),2) AS avg_bachelors_or_higher_2000
FROM fips_code_data AS f
JOIN census_education AS v
ON (f.fips_code = v.fips_code)
GROUP BY f.state, f.county
ORDER BY f.state, f.county;""",conn)

df2.head()

     state    county  avg_unemployment_rate  avg_bachelors_or_higher_2000
0  Alabama  Autauga                  1.6901                        4972.0
1  Alabama  Baldwin                  1.9856                       22146.0
2  Alabama  Barbour                  3.3477                        2068.0
3  Alabama     Bibb                  2.9298                         962.0
4  Alabama   Blount                  1.3228                        3235.0

In [55]:
# selection for analyzing education of all degrees categories for bar chart
df3 = pd.read_sql("""SELECT f.state, ROUND(AVG(e.below_hs_diploma_2019),2) AS avg_hs_diploma_2019, ROUND(AVG(e.hs_diploma_2019),2) AS avg_hs_diploma_2019, ROUND(AVG(e.college_or_associate_2019),2) AS avg_college_or_associate_2019, ROUND(AVG(e.bachelors_or_higher_2019),2) AS avg_bachelors_or_higher_2019, ROUND(AVG(e.below_hs_diploma_2000),2) AS avg_below_hs_diploma_2000, ROUND(AVG(e.hs_diploma_2000),2) AS avg_hs_diploma_2000, ROUND(AVG(e.college_or_associate_2000),2) AS avg_college_or_associate_2000, ROUND(AVG(e.bachelors_or_higher_2000),2) AS avg_bachelors_or_higher_2000 
FROM education_data as e
JOIN fips_code_data as f
ON (e.fips_code = f.fips_code)
GROUP BY f.state
ORDER BY f.state;""",conn)

df3.head()

,state,avg_hs_diploma_2019,avg_hs_diploma_2019,avg_college_or_associate_2019,avg_bachelors_or_higher_2019,avg_below_hs_diploma_2000,avg_hs_diploma_2000,avg_college_or_associate_2000,avg_bachelors_or_higher_2000
0,Alabama,6849.58,15266.25,14826.03,12623.46,10657.93,13092.78,11141.72,8203.10
1,Arizona,40575.80,75275.27,106682.67,92968.40,41303.13,52793.60,71901.40,51080.80
2,Arkansas,3602.24,9128.79,7914.35,6176.48,5699.32,7872.21,5665.43,3845.71
3,California,76184.05,93507.97,131873.79,154840.10,85219.71,73938.83,110305.84,97758.03
4,Colorado,4933.61,12772.69,17613.16,24455.22,5672.48,10068.13,13460.59,14183.67